# OutOfPlaneBendDiameterTooSmall Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..OutOfPlaneBendDiameterTooSmall Property
BuiltInFailures..::..RebarFailures Class See Also
---
The Out of Plane Bend Diameter for Rebar Shape XX is too small for Rebar Bar Type YY.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OutOfPlaneBendDiameterTooSmall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OutOfPlaneBendDiameterTooSmall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OutOfPlaneBendDiameterTooSmall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace